Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz1064dab176.h
#define _GLCDCURDATA44_PIXEL110_POSITION         0x0000001C
#define _GLCDCURDATA44_PIXEL110_MASK             0xF0000000
#define _GLCDCURDATA44_PIXEL110_LENGTH           0x00000004

#define _GLCDCURDATA45_PIXEL1115_POSITION        0x00000000
#define _GLCDCURDATA45_PIXEL1115_MASK            0x0000000F
#define _GLCDCURDATA45_PIXEL1115_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL1114_POSITION        0x00000004
#define _GLCDCURDATA45_PIXEL1114_MASK            0x000000F0
#define _GLCDCURDATA45_PIXEL1114_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL1113_POSITION        0x00000008
#define _GLCDCURDATA45_PIXEL1113_MASK            0x00000F00
#define _GLCDCURDATA45_PIXEL1113_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL1112_POSITION        0x0000000C
#define _GLCDCURDATA45_PIXEL1112_MASK            0x0000F000
#define _GLCDCURDATA45_PIXEL1112_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL1111_POSITION        0x00000010
#define _GLCDCURDATA45_PIXEL1111_MASK            0x000F0000
#define _GLCDCURDATA45_PIXEL1111_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL1110_POSITION        0x00000014
#define _GLCDCURDATA45_PIXEL1110_MASK            0x00F00000
#define _GLCDCURDATA45_PIXEL1110_LENGTH          0x00000004

#define _GLCDCURDATA45_PIXEL119_POSITION         0x00000018
#define _GLCDCURDATA45_PIXEL119_MASK             0x0F000000
#define _GLCDCURDATA45_PIXEL119_LENGTH           0x00000004

#define _GLCDCURDATA45_PIXEL118_POSITION         0x0000001C
#define _GLCDCURDATA45_PIXEL118_MASK             0xF0000000
#define _GLCDCURDATA45_PIXEL118_LENGTH           0x00000004

#define _GLCDCURDATA46_PIXEL1123_POSITION        0x00000000
#define _GLCDCURDATA46_PIXEL1123_MASK            0x0000000F
#define _GLCDCURDATA46_PIXEL1123_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1122_POSITION        0x00000004
#define _GLCDCURDATA46_PIXEL1122_MASK            0x000000F0
#define _GLCDCURDATA46_PIXEL1122_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1121_POSITION        0x00000008
#define _GLCDCURDATA46_PIXEL1121_MASK            0x00000F00
#define _GLCDCURDATA46_PIXEL1121_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1120_POSITION        0x0000000C
#define _GLCDCURDATA46_PIXEL1120_MASK            0x0000F000
#define _GLCDCURDATA46_PIXEL1120_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1119_POSITION        0x00000010
#define _GLCDCURDATA46_PIXEL1119_MASK            0x000F0000
#define _GLCDCURDATA46_PIXEL1119_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1118_POSITION        0x00000014
#define _GLCDCURDATA46_PIXEL1118_MASK            0x00F00000
#define _GLCDCURDATA46_PIXEL1118_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1117_POSITION        0x00000018
#define _GLCDCURDATA46_PIXEL1117_MASK            0x0F000000
#define _GLCDCURDATA46_PIXEL1117_LENGTH          0x00000004

#define _GLCDCURDATA46_PIXEL1116_POSITION        0x0000001C
#define _GLCDCURDATA46_PIXEL1116_MASK            0xF0000000
#define _GLCDCURDATA46_PIXEL1116_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1131_POSITION        0x00000000
#define _GLCDCURDATA47_PIXEL1131_MASK            0x0000000F
#define _GLCDCURDATA47_PIXEL1131_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1130_POSITION        0x00000004
#define _GLCDCURDATA47_PIXEL1130_MASK            0x000000F0
#define _GLCDCURDATA47_PIXEL1130_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1129_POSITION        0x00000008
#define _GLCDCURDATA47_PIXEL1129_MASK            0x00000F00
#define _GLCDCURDATA47_PIXEL1129_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1128_POSITION        0x0000000C
#define _GLCDCURDATA47_PIXEL1128_MASK            0x0000F000
#define _GLCDCURDATA47_PIXEL1128_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1127_POSITION        0x00000010
#define _GLCDCURDATA47_PIXEL1127_MASK            0x000F0000
#define _GLCDCURDATA47_PIXEL1127_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1126_POSITION        0x00000014
#define _GLCDCURDATA47_PIXEL1126_MASK            0x00F00000
#define _GLCDCURDATA47_PIXEL1126_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1125_POSITION        0x00000018
#define _GLCDCURDATA47_PIXEL1125_MASK            0x0F000000
#define _GLCDCURDATA47_PIXEL1125_LENGTH          0x00000004

#define _GLCDCURDATA47_PIXEL1124_POSITION        0x0000001C
#define _GLCDCURDATA47_PIXEL1124_MASK            0xF0000000
#define _GLCDCURDATA47_PIXEL1124_LENGTH          0x00000004

#define _GLCDCURDATA48_PIXEL127_POSITION         0x00000000
#define _GLCDCURDATA48_PIXEL127_MASK             0x0000000F
#define _GLCDCURDATA48_PIXEL127_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL126_POSITION         0x00000004
#define _GLCDCURDATA48_PIXEL126_MASK             0x000000F0
#define _GLCDCURDATA48_PIXEL126_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL125_POSITION         0x00000008
#define _GLCDCURDATA48_PIXEL125_MASK             0x00000F00
#define _GLCDCURDATA48_PIXEL125_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL124_POSITION         0x0000000C
#define _GLCDCURDATA48_PIXEL124_MASK             0x0000F000
#define _GLCDCURDATA48_PIXEL124_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL123_POSITION         0x00000010
#define _GLCDCURDATA48_PIXEL123_MASK             0x000F0000
#define _GLCDCURDATA48_PIXEL123_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL122_POSITION         0x00000014
#define _GLCDCURDATA48_PIXEL122_MASK             0x00F00000
#define _GLCDCURDATA48_PIXEL122_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL121_POSITION         0x00000018
#define _GLCDCURDATA48_PIXEL121_MASK             0x0F000000
#define _GLCDCURDATA48_PIXEL121_LENGTH           0x00000004

#define _GLCDCURDATA48_PIXEL120_POSITION         0x0000001C
#define _GLCDCURDATA48_PIXEL120_MASK             0xF0000000
#define _GLCDCURDATA48_PIXEL120_LENGTH           0x00000004

#define _GLCDCURDATA49_PIXEL1215_POSITION        0x00000000
#define _GLCDCURDATA49_PIXEL1215_MASK            0x0000000F
#define _GLCDCURDATA49_PIXEL1215_LENGTH          0x00000004

