Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz1064dab176.h
#define _SDHCSTAT1_BREN_POSITION                 0x0000000B
#define _SDHCSTAT1_BREN_MASK                     0x00000800
#define _SDHCSTAT1_BREN_LENGTH                   0x00000001

#define _SDHCSTAT1_CARDINS_POSITION              0x00000010
#define _SDHCSTAT1_CARDINS_MASK                  0x00010000
#define _SDHCSTAT1_CARDINS_LENGTH                0x00000001

#define _SDHCSTAT1_CARDST_POSITION               0x00000011
#define _SDHCSTAT1_CARDST_MASK                   0x00020000
#define _SDHCSTAT1_CARDST_LENGTH                 0x00000001

#define _SDHCSTAT1_CDSLVL_POSITION               0x00000012
#define _SDHCSTAT1_CDSLVL_MASK                   0x00040000
#define _SDHCSTAT1_CDSLVL_LENGTH                 0x00000001

#define _SDHCSTAT1_WPSLVL_POSITION               0x00000013
#define _SDHCSTAT1_WPSLVL_MASK                   0x00080000
#define _SDHCSTAT1_WPSLVL_LENGTH                 0x00000001

#define _SDHCSTAT1_DATA0SLVL_POSITION            0x00000014
#define _SDHCSTAT1_DATA0SLVL_MASK                0x00100000
#define _SDHCSTAT1_DATA0SLVL_LENGTH              0x00000001

#define _SDHCSTAT1_DATA1SLVL_POSITION            0x00000015
#define _SDHCSTAT1_DATA1SLVL_MASK                0x00200000
#define _SDHCSTAT1_DATA1SLVL_LENGTH              0x00000001

#define _SDHCSTAT1_DATA2SLVL_POSITION            0x00000016
#define _SDHCSTAT1_DATA2SLVL_MASK                0x00400000
#define _SDHCSTAT1_DATA2SLVL_LENGTH              0x00000001

#define _SDHCSTAT1_DATA3SLVL_POSITION            0x00000017
#define _SDHCSTAT1_DATA3SLVL_MASK                0x00800000
#define _SDHCSTAT1_DATA3SLVL_LENGTH              0x00000001

#define _SDHCSTAT1_CMDSLVL_POSITION              0x00000018
#define _SDHCSTAT1_CMDSLVL_MASK                  0x01000000
#define _SDHCSTAT1_CMDSLVL_LENGTH                0x00000001

#define _SDHCCON1_DTXWIDTH_POSITION              0x00000001
#define _SDHCCON1_DTXWIDTH_MASK                  0x00000002
#define _SDHCCON1_DTXWIDTH_LENGTH                0x00000001

#define _SDHCCON1_HSEN_POSITION                  0x00000002
#define _SDHCCON1_HSEN_MASK                      0x00000004
#define _SDHCCON1_HSEN_LENGTH                    0x00000001

#define _SDHCCON1_DMASEL_POSITION                0x00000003
#define _SDHCCON1_DMASEL_MASK                    0x00000018
#define _SDHCCON1_DMASEL_LENGTH                  0x00000002

#define _SDHCCON1_CDTLVL_POSITION                0x00000006
#define _SDHCCON1_CDTLVL_MASK                    0x00000040
#define _SDHCCON1_CDTLVL_LENGTH                  0x00000001

#define _SDHCCON1_CDSSEL_POSITION                0x00000007
#define _SDHCCON1_CDSSEL_MASK                    0x00000080
#define _SDHCCON1_CDSSEL_LENGTH                  0x00000001

#define _SDHCCON1_SDBP_POSITION                  0x00000008
#define _SDHCCON1_SDBP_MASK                      0x00000100
#define _SDHCCON1_SDBP_LENGTH                    0x00000001

#define _SDHCCON1_SBGREQ_POSITION                0x00000010
#define _SDHCCON1_SBGREQ_MASK                    0x00010000
#define _SDHCCON1_SBGREQ_LENGTH                  0x00000001

#define _SDHCCON1_CONTREQ_POSITION               0x00000011
#define _SDHCCON1_CONTREQ_MASK                   0x00020000
#define _SDHCCON1_CONTREQ_LENGTH                 0x00000001

#define _SDHCCON1_RDWTCON_POSITION               0x00000012
#define _SDHCCON1_RDWTCON_MASK                   0x00040000
#define _SDHCCON1_RDWTCON_LENGTH                 0x00000001

#define _SDHCCON1_INTBG_POSITION                 0x00000013
#define _SDHCCON1_INTBG_MASK                     0x00080000
#define _SDHCCON1_INTBG_LENGTH                   0x00000001

#define _SDHCCON1_WKONINT_POSITION               0x00000018
#define _SDHCCON1_WKONINT_MASK                   0x01000000
#define _SDHCCON1_WKONINT_LENGTH                 0x00000001

#define _SDHCCON1_WKONINS_POSITION               0x00000019
#define _SDHCCON1_WKONINS_MASK                   0x02000000
#define _SDHCCON1_WKONINS_LENGTH                 0x00000001

#define _SDHCCON1_WKONREM_POSITION               0x0000001A
#define _SDHCCON1_WKONREM_MASK                   0x04000000
#define _SDHCCON1_WKONREM_LENGTH                 0x00000001

#define _SDHCCON2_ICLKEN_POSITION                0x00000000
#define _SDHCCON2_ICLKEN_MASK                    0x00000001
#define _SDHCCON2_ICLKEN_LENGTH                  0x00000001

#define _SDHCCON2_ICLKSTABLE_POSITION            0x00000001
#define _SDHCCON2_ICLKSTABLE_MASK                0x00000002
#define _SDHCCON2_ICLKSTABLE_LENGTH              0x00000001

#define _SDHCCON2_SDCLKEN_POSITION               0x00000002
#define _SDHCCON2_SDCLKEN_MASK                   0x00000004
#define _SDHCCON2_SDCLKEN_LENGTH                 0x00000001

#define _SDHCCON2_SDCLKDIV_POSITION              0x00000008
#define _SDHCCON2_SDCLKDIV_MASK                  0x0000FF00
#define _SDHCCON2_SDCLKDIV_LENGTH                0x00000008

#define _SDHCCON2_DTOC_POSITION                  0x00000010
#define _SDHCCON2_DTOC_MASK                      0x000F0000
#define _SDHCCON2_DTOC_LENGTH                    0x00000004

#define _SDHCCON2_SWRALL_POSITION                0x00000018
#define _SDHCCON2_SWRALL_MASK                    0x01000000
#define _SDHCCON2_SWRALL_LENGTH                  0x00000001

#define _SDHCCON2_SWRCMD_POSITION                0x00000019
#define _SDHCCON2_SWRCMD_MASK                    0x02000000
#define _SDHCCON2_SWRCMD_LENGTH                  0x00000001

#define _SDHCCON2_SWRDATA_POSITION               0x0000001A
#define _SDHCCON2_SWRDATA_MASK                   0x04000000
#define _SDHCCON2_SWRDATA_LENGTH                 0x00000001

#define _SDHCINTSTAT_CCIF_POSITION               0x00000000
#define _SDHCINTSTAT_CCIF_MASK                   0x00000001
#define _SDHCINTSTAT_CCIF_LENGTH                 0x00000001

#define _SDHCINTSTAT_TXCIF_POSITION              0x00000001
#define _SDHCINTSTAT_TXCIF_MASK                  0x00000002
#define _SDHCINTSTAT_TXCIF_LENGTH                0x00000001

#define _SDHCINTSTAT_BGIF_POSITION               0x00000002
#define _SDHCINTSTAT_BGIF_MASK                   0x00000004
#define _SDHCINTSTAT_BGIF_LENGTH                 0x00000001

#define _SDHCINTSTAT_DMAIF_POSITION              0x00000003
#define _SDHCINTSTAT_DMAIF_MASK                  0x00000008
#define _SDHCINTSTAT_DMAIF_LENGTH                0x00000001

